$(document).ready(function () {
    var tedadeSokhanan = 59;
    var sokhanBozorgan = new Array(tedadeSokhanan);
    sokhanBozorgan[0] = 'سقراط: "خشم و دشمنی را به درگاه مردان با اراده راهی نیست"';
    sokhanBozorgan[1] = 'سقراط: "پیش تمام دشمنان به نزدیکترین دشمن خود که زبان است توجه داشته باش"';
    sokhanBozorgan[2] = 'ویلیام شکسپیر: "آنان که پیروز می شوند، همان کسانی هستند که از مشورت دوستان بهره می برند"';
    sokhanBozorgan[3] = 'گالیله: "هر کس مرتکب اشتباهی نشده، اکتشافی هم نکرده است"';
    sokhanBozorgan[4] = 'چارلی چاپلین: "خیلی تلاش کردم مردم بفهمند ولی آن ها فقط خندیدند"';
    sokhanBozorgan[5] = 'حافظ: "چند روزی که در این مرحله مهلت داری / خوش بیاسای زمانی که زمان این همه نیست"';
    sokhanBozorgan[6] = 'امام علی (ع): "بزرگترین عیب برای دنیا همین بس که بی وفاست"';
    sokhanBozorgan[7] = 'همیلتون: "بر روی زمین چیزی بزرگتر از انسان نیست و در انسان چیزی بزرگتر از فکر او"';
    sokhanBozorgan[8] = 'دوما: "زندگی بسیار مسحور کننده است، فقط باید با عینک مناسبی به آن نگریست"';
    sokhanBozorgan[9] = 'اسکار وایله: "هنر، کلید فهم زندگی است"';
    sokhanBozorgan[10] = 'خلیل جبران: "اگر زیبایی را آواز سر دهی، حتی در تنهایی بیابان، گوش شنوا خواهی یافت"';
    sokhanBozorgan[11] = 'فرانکلین: "هیچ وقت به گمان این که وقت دارید ننشینید، زیرا در عمل خواهید دید که همیشه وقت کم و کوتاه است"';
    sokhanBozorgan[12] = 'نیمایوشیج: "هر قدر به طبیعت نزدیک شوی، زندگانی شایسته تری را پیدا می کنی"';
    sokhanBozorgan[13] = 'داستایوفسکی: "تنها آرامش و سکوت سرچشمه ی نیروی لایزال است"';
    sokhanBozorgan[14] = 'دکتر علی شریعتی: "خداوندا مرا از کسانی قرار ده که دنیاشان را برای دینشان می فروشند، نه دینشان را برای دنیاشان"';
    sokhanBozorgan[15] = 'سقراط: "من تنها یک چیز می دانم و آن این که هیچ نمی دانم"';
    sokhanBozorgan[16] = 'امام علی (ع): "تمام محبتت را به پای دوستت بریز، نه تمام اعتمادت را."';
    sokhanBozorgan[17] = 'گوته: "کسی که دارای عزمی راسخ است، جهان را مطابق میل خویش عوض می کند"';
    sokhanBozorgan[18] = 'جانسون: "بهتر است ثروتمند زندگی کنیم تا این که ثروتمند بمیریم"';
    sokhanBozorgan[19] = 'سقراط: "شیرینی یکبار پیروزی، به تلخی صد بار شکست می‌ارزد"';
    sokhanBozorgan[20] = 'آنتوان چخوف: "انسان باید از هر حیث، چه ظاهر و چه باطن، زیبا و آراسته باشد"';
    sokhanBozorgan[21] = 'لاما: "برای اداره کردن خویش از سرت استفاده کن و برای اداره کردن دیگران، از قلبت"';
    sokhanBozorgan[22] = 'موریس مترلینگ: "اگر در اولین قدم، موفقیت نصیب ما می شد، سعی و عمل دیگر معنی نداشت"';
    sokhanBozorgan[23] = 'دکتر علی شریعتی: "لحظه ها را گذراندیم که به خوشبختی برسیم، غافل از آ نکه لحظه ها همان خوشبختی بودند"';
    sokhanBozorgan[24] = 'امرسون: "بیشترین تأثیر افراد خوب زمانى احساس مى شود که از میان ما رفته باشند"';
    sokhanBozorgan[25] = 'آلبرت اینشتین: "از دیروز بیاموز، برای امروز زندگی کن و امید به فردا داشته باش"';
    sokhanBozorgan[26] = 'گاندی: "پیروزی آن نیست که هرگز زمین نخوری، آنست که بعد از هر زمین خوردنی برخیزی"';
    sokhanBozorgan[27] = 'ناپلئون هیل: "دانستن کافی نیست، باید به دانسته خود عمل کنید"';
    sokhanBozorgan[28] = 'ناپلئون هیل: "پشتکار با کسانی است که پشتکار بیشتری دارند"';
    sokhanBozorgan[29] = 'فردوسی: "دانش ارزش آن را دارد که به خاطر آن رنج ها بکشی"';
    sokhanBozorgan[30] = 'فردوسی: "خرد برترین هدیه الهی است"';
    sokhanBozorgan[31] = 'فردوسی: "خداوند درهای هنر را بر روی دانایان دادگر گشوده است"';
    sokhanBozorgan[32] = 'بزرگمهر: "برای نادان، پیرایه ای سزاورتر و زیباتر از خاموشی نیست"';
    sokhanBozorgan[33] = 'بزرگمهر: "روشندل و نکته دان کسی است که سخنان کوتاه و پر معنی بگوید"';
    sokhanBozorgan[34] = 'بزرگمهر: "به بسیار گفتن آبروی خود مبر"';
    sokhanBozorgan[35] = 'جبران خلیل جبران: "رابطه دلی دو دوست، نیاز به بیان الفاظ و عبارات ندارد"';
    sokhanBozorgan[36] = 'جبران خلیل جبران: "ایمان از کردار جدا نیست و عمل از پندار"';
    sokhanBozorgan[37] = 'جبران خلیل جبران: "به رویاها ایمان بیاورید که دروازه های ابدیت اند"';
    sokhanBozorgan[38] = 'میکلانژ: "خداوندا، آنچه را که بیش از آنچه قدرت انجامش را داشته باشم، آرزویش را دارم، به من عطا کن"';
    sokhanBozorgan[39] = 'مولانا: "خویش را صافی کن از اوصاف خود / تا ببینی ذات پاک صاف خود"';
    sokhanBozorgan[40] = 'مادر ترزا: "اگر می خواهید برای ایجاد آشتی در جهان کاری انجام دهید، به خانه هایتان بروید و خانوادتان را دوست بدارید"';
    sokhanBozorgan[41] = 'آلن لاکین: "برنامه ريزي، آوردن آينده به زمان حال است تا بتوانيد همين حالا كاري براي آن انجام دهيد"';
    sokhanBozorgan[42] = 'کلود دایموند: "پول باعث می شود که یک فرد خوب، خوب تر شود و یک فرد بد، بدتر"';
    sokhanBozorgan[43] = 'آبرهام لینکلن: "به همه اعتماد داشتن خطرناك است، به هيچ كس اعتماد نداشتن خطرناك ترين است."';
    sokhanBozorgan[44] = 'ولتر: "از کشوری که بهای خدمتکاران و دانشمندان را نداند و از آنان سپاسگزاری ننماید، نباید امید پیشرفت داشت"';
    sokhanBozorgan[45] = 'مادر ترزا: "موضوع اين نيست كه چه كاري مي كنيم، مهم، ميزان عشقي است كه به كارمان داريم"';
    sokhanBozorgan[46] = 'دیو توماس: "هوای کسب و کارتان را داشته باشید تا کسب و کارتان هوای شما را داشته باشد"';
    sokhanBozorgan[47] = 'ویلیام ماتیوس: "نخستین قانون موفقیت، تمرکز است"';
    sokhanBozorgan[48] = 'آلبرت اینشتین: "فکر کردن، سخت ترین کار بشر است"';
    sokhanBozorgan[49] = 'افلاطون: "با وجود عشق، هر انسانی سراینده می شود"';
    sokhanBozorgan[50] = 'آلبرت اینشتین: "من ماه ها و سال ها فکر می کنم، در نود و نه مورد نتیجه مطلوب نیست ولی در بار صدم راه درست را می یابم"';
    sokhanBozorgan[51] = 'استیونس: "روی زین زندگی، راحت بنشینید"';
    sokhanBozorgan[52] = 'رالف امرسون: "پاداش کاری که خوب انجام گرفته، همان انجام آن کار است"';
    sokhanBozorgan[53] = 'ویلیام فتر: "بعضی افراد چنان در تدارک آماده شدن برای روز بارانی هستند که از روزهای آفتابی لذت نمی برند"';
    sokhanBozorgan[54] = 'آلبرت اینشتین: "به جای اینکه سعی کنید مرد موفقیت باشید، سعی کنید مرد ارزش ها باشید"';
    sokhanBozorgan[55] = 'بیل گیتس: "با هیچکسی جز خودم رقابت نمی کنم،هدف من مغلوب کردن اخرین کاری است که انجام داده ام"';
    sokhanBozorgan[56] = 'بیل گیتس: "موفقیت یک معلم فریبکار است. او به افراد باهوش تلقین می کند که شما هیچ گاه اشتباه نمی کنید"';
    sokhanBozorgan[57] = 'توماس ادیسون: "من هیچ وقت شکست نخوردم، من فقط 10 هزار راه پیدا کردم که به هدف نمی رسید"';
    sokhanBozorgan[58] = 'استیو جابز: "معیاری برای تعیین کیفیت باشید. اغلب افراد عادت ندارند عالی باشند ولی شما می توانید بهترین باشید"';

    function EntekhabRandomSokhan(range) {
        if (Math.random) {
            return Math.round(Math.random() * (range - 1));
        }
        else {
            var now = new Date();
            return (now.getTime() / 1000) % range;
        }
    }

    var entekhab = EntekhabRandomSokhan(tedadeSokhanan);
    $('.sokhan').html(sokhanBozorgan[entekhab]);
});